###############################################################################
# Created by write_sdc
# Tue Feb 24 15:43:47 2026
###############################################################################
current_design fir_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 6.5000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_input_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[0]}]
set_input_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[10]}]
set_input_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[11]}]
set_input_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[12]}]
set_input_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[13]}]
set_input_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[14]}]
set_input_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[15]}]
set_input_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[1]}]
set_input_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[2]}]
set_input_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[3]}]
set_input_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[4]}]
set_input_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[5]}]
set_input_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[6]}]
set_input_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[7]}]
set_input_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[8]}]
set_input_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[9]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[0]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[10]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[11]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[12]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[13]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[14]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[15]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[16]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[17]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[18]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[19]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[1]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[20]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[21]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[22]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[23]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[24]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[25]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[26]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[27]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[28]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[29]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[2]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[30]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[31]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[32]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[33]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[34]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[35]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[36]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[37]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[38]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[39]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[3]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[4]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[5]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[6]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[7]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[8]}]
set_output_delay 1.3000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {y_out[39]}]
set_load -pin_load 0.0334 [get_ports {y_out[38]}]
set_load -pin_load 0.0334 [get_ports {y_out[37]}]
set_load -pin_load 0.0334 [get_ports {y_out[36]}]
set_load -pin_load 0.0334 [get_ports {y_out[35]}]
set_load -pin_load 0.0334 [get_ports {y_out[34]}]
set_load -pin_load 0.0334 [get_ports {y_out[33]}]
set_load -pin_load 0.0334 [get_ports {y_out[32]}]
set_load -pin_load 0.0334 [get_ports {y_out[31]}]
set_load -pin_load 0.0334 [get_ports {y_out[30]}]
set_load -pin_load 0.0334 [get_ports {y_out[29]}]
set_load -pin_load 0.0334 [get_ports {y_out[28]}]
set_load -pin_load 0.0334 [get_ports {y_out[27]}]
set_load -pin_load 0.0334 [get_ports {y_out[26]}]
set_load -pin_load 0.0334 [get_ports {y_out[25]}]
set_load -pin_load 0.0334 [get_ports {y_out[24]}]
set_load -pin_load 0.0334 [get_ports {y_out[23]}]
set_load -pin_load 0.0334 [get_ports {y_out[22]}]
set_load -pin_load 0.0334 [get_ports {y_out[21]}]
set_load -pin_load 0.0334 [get_ports {y_out[20]}]
set_load -pin_load 0.0334 [get_ports {y_out[19]}]
set_load -pin_load 0.0334 [get_ports {y_out[18]}]
set_load -pin_load 0.0334 [get_ports {y_out[17]}]
set_load -pin_load 0.0334 [get_ports {y_out[16]}]
set_load -pin_load 0.0334 [get_ports {y_out[15]}]
set_load -pin_load 0.0334 [get_ports {y_out[14]}]
set_load -pin_load 0.0334 [get_ports {y_out[13]}]
set_load -pin_load 0.0334 [get_ports {y_out[12]}]
set_load -pin_load 0.0334 [get_ports {y_out[11]}]
set_load -pin_load 0.0334 [get_ports {y_out[10]}]
set_load -pin_load 0.0334 [get_ports {y_out[9]}]
set_load -pin_load 0.0334 [get_ports {y_out[8]}]
set_load -pin_load 0.0334 [get_ports {y_out[7]}]
set_load -pin_load 0.0334 [get_ports {y_out[6]}]
set_load -pin_load 0.0334 [get_ports {y_out[5]}]
set_load -pin_load 0.0334 [get_ports {y_out[4]}]
set_load -pin_load 0.0334 [get_ports {y_out[3]}]
set_load -pin_load 0.0334 [get_ports {y_out[2]}]
set_load -pin_load 0.0334 [get_ports {y_out[1]}]
set_load -pin_load 0.0334 [get_ports {y_out[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
